//Демонстрация проблемы с незаполненным измерением сост. типа (Неопределено) при установке упр. блокировки по независимому регистру сведений
//В одном сеансе читаем данные по пустому измерению "ГрафикРаботы", в другом сеансе уже не можем записать данные ни по одному графику
//Использование пустого измерения в отборе при чтении - блокирует
&НаСервере
Процедура КомандаПрочитатьНаСервере()
	НачатьТранзакцию();
	НЗ = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НЗ.Отбор.ГрафикРаботы.Установить(График);
	НЗ.Отбор.День.Установить(День);
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда
		НормаЧасов = НЗ[0].НормаЧасов;
	КонецЕсли;
	ОтменитьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочитать(Команда)
	КомандаПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьНаСервере()
	НачатьТранзакцию();
	НЗ = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НЗ.Отбор.ГрафикРаботы.Установить(График);
	НЗ.Отбор.День.Установить(День);
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.ГрафикРаботы = График;
	НоваяЗапись.День = День;
	НоваяЗапись.НормаЧасов = НормаЧасов;
	НЗ.Записать();
	ОтменитьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	КомандаЗаписатьНаСервере();
КонецПроцедуры
