
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Контроль остатков
	 Блокировка = Новый БлокировкаДанных;
	 ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	 ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	 ЭлементБлокировки.ИсточникДанных = Товары;
	 ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	 ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	 Блокировка.Заблокировать();
	 
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТребованиеТовары.НомерСтроки,
	               |	ТребованиеТовары.Товар КАК Товар,
	               |	ТребованиеТовары.Склад КАК Склад,
	               |	ТребованиеТовары.Количество
	               |ПОМЕСТИТЬ ВТТовары
	               |ИЗ
	               |	Документ.Требование.Товары КАК ТребованиеТовары
	               |ГДЕ
	               |	ТребованиеТовары.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребованиеТовары.Склад,
	               |	ТребованиеТовары.Товар,
	               |	ТребованиеТовары.Количество,
	               |	ЕСТЬNULL(ОстаткиТоваров.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ИЗ
	               |	ВТТовары КАК ТребованиеТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
	               |				&Период,
				   |					(Товар, Склад) В
				   |						(ВЫБРАТЬ
				   |							ВТТовары.Товар, ВТТовары.Склад
				   |						ИЗ
				   |							ВТТовары)
	               |) КАК ОстаткиТоваров
	               |		ПО ТребованиеТовары.Товар = ОстаткиТоваров.Товар";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("Период", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			//Сообщить(СтрШаблон("На складе %1 нехватает остатка товара %2 (имеется %3, необходимо %4)", Склад, Выборка.Товар, Выборка.КоличествоОстаток, Выборка.Количество));
			Сообщить("На складе " + Выборка.Склад + " нехватает остатка товара " + Выборка.Товар + " (имеется " + Выборка.КоличествоОстаток + ", необходимо " + Выборка.Количество + ")");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Движения
	
	//Остатки
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.ОстаткиТоваров.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Склад = СтрокаТоваров.Склад;
		НовоеДвижение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры
