
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого СтрокаТЧ Из Проводки Цикл
		Проводка = Движения.Проводки.Добавить();
		Проводка.Период = Дата;
		Проводка.Организация = Организация;
		Проводка.СчетДт = СтрокаТЧ.СчетДт;
		Если Проводка.СчетДт.ВидыСубконто.Количество() > 0 Тогда
			Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[0].ВидСубконто, СтрокаТЧ.СубконтоДт1);
			Если Проводка.СчетДт.ВидыСубконто.Количество() > 1 Тогда
				Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[1].ВидСубконто, СтрокаТЧ.СубконтоДт2);
				Если Проводка.СчетДт.ВидыСубконто.Количество() > 2 Тогда
					Проводка.СубконтоДт.Вставить(Проводка.СчетДт.ВидыСубконто[2].ВидСубконто, СтрокаТЧ.СубконтоДт3);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Проводка.КоличествоДт = СтрокаТЧ.КоличествоДт;
		Проводка.СчетКт = СтрокаТЧ.СчетКт;
		Если Проводка.СчетКт.ВидыСубконто.Количество() > 0 Тогда
			Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[0].ВидСубконто, СтрокаТЧ.СубконтоКт1);
			Если Проводка.СчетКт.ВидыСубконто.Количество() > 1 Тогда
				Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[1].ВидСубконто, СтрокаТЧ.СубконтоКт2);
				Если Проводка.СчетКт.ВидыСубконто.Количество() > 2 Тогда
					Проводка.СубконтоКт.Вставить(Проводка.СчетКт.ВидыСубконто[2].ВидСубконто, СтрокаТЧ.СубконтоКт3);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Проводка.КоличествоКт = СтрокаТЧ.КоличествоКт;
		Проводка.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;
	
	Движения.Проводки.Записать();
КонецПроцедуры
