
Процедура ПередЗаписью(Отказ)
	Наименование = Фамилия + " " + Имя + " " + Отчество;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Попытка
		ЗаписатьКонтактнуюИнформацию();
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//ФИО физлиц
	МЗ = РегистрыСведений.ФИОФизлиц.СоздатьМенеджерЗаписи();
	МЗ.Период = ТекущаяДата();
	МЗ.Физлицо = Ссылка;
	МЗ.Фамилия = Фамилия;
	МЗ.Имя = Имя;
	МЗ.Отчество = Отчество;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаписатьКонтактнуюИнформацию()
	//Контактная информация
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Для каждого СтрКонтакт Из КонтактнаяИнформация Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Период = ТекущаяДата();
		ЗаписьНабора.Объект = Ссылка;
		ЗаписьНабора.Тип = СтрКонтакт.Тип;
		ЗаписьНабора.Вид = СтрКонтакт.Вид;
		ЗаписьНабора.Данные = СтрКонтакт.Данные;		
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры