
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Движения
	
	//Остатки
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.ОстаткиТоваров.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
	//Продажи
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.Продажи.Добавить();
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Контрагент = Контрагент;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Количество = -СтрокаТоваров.Количество;
		НовоеДвижение.Стоимость = -СтрокаТоваров.Сумма;
	КонецЦикла;
	//Движения.Продажи.Записывать = Истина;
	
	//Движения.Остатки.БлокироватьДляИзменения = Истина;
	Движения.Продажи.Записать();
	
	Движения.ОстаткиТоваров.Записать();
	
	//Движения.ОстаткиТоваров.Прочитать();
	//Движения.Записать();
	
	//ТекстЗапроса = "ВЫБРАТЬ Товар, КоличествоОстаток ИЗ РегистрНакопления.ОстаткиТоваров.Остатки( , Склад = &Склад)";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Склад", Склад);
	//ТЗ = Запрос.Выполнить().Выгрузить();


КонецПроцедуры
