Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Цены;
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.ЦеныТоваров.Добавить();
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Цена = СтрокаТоваров.Цена;
	КонецЦикла;
	Движения.ЦеныТоваров.Записать();	
	
	//Остатки
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.Остатки.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	
	//Движения.Остатки.Записывать = Истина;
	
	Движения.Остатки.Записать();
	
	//Остатки
	Для каждого СтрокаТоваров Из Товары Цикл
		НовоеДвижение = Движения.Партии.Добавить();
		НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
		НовоеДвижение.Период = Дата;
		НовоеДвижение.Товар = СтрокаТоваров.Товар;
		НовоеДвижение.Склад = Склад;
		НовоеДвижение.Партия = Ссылка;
		НовоеДвижение.Количество = СтрокаТоваров.Количество;
		НовоеДвижение.Стоимость = СтрокаТоваров.Сумма;
	КонецЦикла;
	
	Движения.Партии.Записать();
КонецПроцедуры
